simonduq/sdk-nrf/drivers/wifi/nrf71/src/system/fmac_event.c
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}


#ifdef NRF71_UTIL
static enum nrf_wifi_status umac_event_sys_debug_stats_process(
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
	void *event)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_event_debug_stats *ev = event;
	struct nrf_wifi_rpu_debug_stats *dst;

	if (!event) {
		LOG_ERR("%s: Invalid parameters", __func__);
		goto out;
	}

	if (!fmac_dev_ctx->debug_stats_req) {
		LOG_DBG("%s: Debug stats recd when req was not sent!",
				      __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
		goto out;
	}

	dst = (struct nrf_wifi_rpu_debug_stats *)fmac_dev_ctx->debug_stats;
	if (dst) {
		nrf_wifi_mem_cpy(dst, &ev->stats, sizeof(ev->stats));
	}
	fmac_dev_ctx->debug_stats_req = false;
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}


static enum nrf_wifi_status umac_event_sys_umac_int_stats_process(
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
	void *event)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct umac_int_stats *ev = event;
	struct umac_int_stats *dst;

	if (!event) {
		LOG_ERR("%s: Invalid parameters", __func__);
		goto out;
	}

	if (!fmac_dev_ctx->umac_int_stats_req) {
		LOG_DBG("%s: UMAC int stats recd when req was not sent!",
				      __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
		goto out;
	}

	dst = (struct umac_int_stats *)fmac_dev_ctx->umac_int_stats;
	if (dst) {
		nrf_wifi_mem_cpy(dst, ev, sizeof(*ev));
	}
	fmac_dev_ctx->umac_int_stats_req = false;
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}
#endif /* NRF71_UTIL */

#if WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF
struct error_stats_log_entry {
	unsigned int status_code;
	const char *msg;
};

static const struct error_stats_log_entry umac_error_stats_log[] = {
	{ UMAC_MEM_ALLOC_FAIL, "memory allocation failed" },
};

static const struct error_stats_log_entry lmac_error_stats_log[] = {
	{ RX_INT_MEM_UNDERRUN, "RX internal memory underrun" },
	{ DATA_PATH_STUCK, "data path stuck" },
	{ WIFI_REQ_TO_PTA_FAIL, "Wi-Fi request to PTA failed" },
	{ HW_DATA_PATH_DEACTIVATE_FAIL, "HW data path deactivation failed" },
	{ HW_DATA_PATH_ACTIVATE_FAIL, "HW data path activation failed" },
	{ CAPTURE_DMA_NOT_FINISHING, "capture DMA not finishing" },
	{ FEED_DMA_NOT_FINISHING, "feed DMA not finishing" },
	{ RF_PLL_RECOVERY_FAILED, "RF PLL recovery failed" },
	{ DEVICE_IS_ACTIVE_FOR_TOO_LONG, "device active for too long" },
	{ LMAC_NO_RX_FRAME_2SEC, "no RX frames received in 2 seconds" },
};

struct error_stats_diag_entry {
	uintptr_t addr;
	const char *label;
};

static const struct error_stats_diag_entry fw_error_stats_diag[] = {
	{ NRF71_WIFI_FW_ISR_CNT_ADDR, "fw isr cnt" },
	{ NRF71_WIFI_FW_DSSS_CRC_FAIL_CNT_ADDR, "fw DSSS CRC fail count" },
	{ NRF71_WIFI_FW_DSSS_CRC_SUCCESS_CNT_ADDR, "fw DSSS CRC success count" },
	{ NRF71_WIFI_FW_OFDM_CRC_SUCCESS_CNT_ADDR, "fw OFDM CRC success count" },
	{ NRF71_WIFI_FW_OFDM_CRC_FAIL_CNT_ADDR, "fw OFDM CRC fail count" },
};

static const struct error_stats_diag_entry hw_error_stats_diag[] = {
	{ NRF71_WIFI_HW_PKT_CNT_ADDR, "hw pkt cnt" },
	{ NRF71_WIFI_HW_DSSS_CRC_FAIL_CNT_ADDR, "hw DSSS CRC fail count" },
	{ NRF71_WIFI_HW_DSSS_CRC_SUCCESS_CNT_ADDR, "hw DSSS CRC success count" },
	{ NRF71_WIFI_HW_OFDM_CRC_SUCCESS_CNT_ADDR, "hw OFDM CRC success count" },
	{ NRF71_WIFI_HW_OFDM_CRC_FAIL_CNT_ADDR, "hw OFDM CRC fail count" },
};

static void log_error_stats_diag(const struct error_stats_diag_entry *table,
				   size_t table_size)
{
	size_t i;

	for (i = 0; i < table_size; i++) {
		LOG_INF("  %s: %u", table[i].label,
			sys_read32(table[i].addr));
	}
}

static void log_error_stats(const char *func,
			    const char *type,
			    unsigned int status_code,
			    const struct error_stats_log_entry *table,
			    size_t table_size)
{
	size_t i;

	for (i = 0; i < table_size; i++) {
		if (table[i].status_code == status_code) {
			LOG_INF("%s: %s error: %s", func, type,
					       table[i].msg);
			log_error_stats_diag(fw_error_stats_diag,
				sizeof(fw_error_stats_diag) /
				sizeof(fw_error_stats_diag[0]));
			log_error_stats_diag(hw_error_stats_diag,
				sizeof(hw_error_stats_diag) /
				sizeof(hw_error_stats_diag[0]));
			return;
		}
	}

	LOG_INF("%s: %s error stats: status_code=%u", func, type,
			       status_code);
	log_error_stats_diag(fw_error_stats_diag,
		sizeof(fw_error_stats_diag) / sizeof(fw_error_stats_diag[0]));
	log_error_stats_diag(hw_error_stats_diag,
		sizeof(hw_error_stats_diag) / sizeof(hw_error_stats_diag[0]));
}
#endif /* WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF */


static enum nrf_wifi_status umac_event_sys_proc_events(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						       struct host_rpu_msg *rpu_msg)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	unsigned char *sys_head = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx;

	if (!fmac_dev_ctx || !rpu_msg) {
		return status;
	}


	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	sys_head = (unsigned char *)rpu_msg->msg;

	switch (((struct nrf_wifi_sys_head *)sys_head)->cmd_event) {
	case NRF_WIFI_EVENT_STATS:
		status = umac_event_sys_stats_process(fmac_dev_ctx,
						      sys_head);
		break;
	case NRF_WIFI_EVENT_INIT_DONE:
		fmac_dev_ctx->fw_init_done = 1;
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	case NRF_WIFI_EVENT_DEINIT_DONE:
		fmac_dev_ctx->fw_deinit_done = 1;
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
#ifdef NRF71_RAW_DATA_TX
	case NRF_WIFI_EVENT_RAW_TX_DONE:
		status = nrf_wifi_fmac_rawtx_done_event_process(fmac_dev_ctx,
						(struct nrf_wifi_event_raw_tx_done *)sys_head);
		break;
#endif
#ifdef NRF71_SYSTEM_WITH_RAW_MODES
	case NRF_WIFI_EVENT_MODE_SET_DONE:
		status = nrf_wifi_fmac_if_mode_set_event_proc(fmac_dev_ctx,
						(struct nrf_wifi_event_raw_config_mode *)sys_head);
		break;
#endif
#if defined(NRF71_RAW_DATA_TX) || defined(NRF71_RAW_DATA_RX)
	case NRF_WIFI_EVENT_CHANNEL_SET_DONE: {
		struct nrf_wifi_event_set_channel *channel_event;
		struct nrf_wifi_sys_fmac_priv *sys_fpriv;
		struct nrf_wifi_fmac_vif_ctx *vif_ctx;
		unsigned int event_len = ((struct nrf_wifi_sys_head *)sys_head)->len;

