simonduq/sdk-nrf/drivers/wifi/nrf71/src/system/fmac_event.c
		channel_event = (struct nrf_wifi_event_set_channel *)sys_head;
		vif_ctx = sys_dev_ctx->vif_ctx[channel_event->if_index];
		if (channel_event->status) {
			LOG_ERR("%s: set channel failed, status=%d",
					     __func__, channel_event->status);
		} else if (vif_ctx) {
			vif_ctx->channel = channel_event->chan.primary_num;
		}
		sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);
		if (sys_fpriv->callbk_fns.channel_set_done_callbk_fn) {
			sys_fpriv->callbk_fns.channel_set_done_callbk_fn(
				vif_ctx ? vif_ctx->os_vif_ctx : NULL,
				channel_event, event_len);
		}
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	}
#endif /* NRF71_RAW_DATA_TX */
#if defined(NRF71_RAW_DATA_RX) || defined(NRF71_PROMISC_DATA_RX)
	case NRF_WIFI_EVENT_FILTER_SET_DONE:
		struct nrf_wifi_event_raw_config_filter *filter_event;

		filter_event = (struct nrf_wifi_event_raw_config_filter *)sys_head;
		if (!filter_event->status) {
			sys_dev_ctx->vif_ctx[filter_event->if_index]->packet_filter =
								filter_event->filter;
		}
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
#endif /* NRF71_RAW_DATA_RX || NRF71_PROMISC_DATA_RX */
	case NRF_WIFI_EVENT_DEBUG_STATS:
#ifdef NRF71_UTIL
		status = umac_event_sys_debug_stats_process(fmac_dev_ctx,
							    sys_head);
#else
		LOG_DBG("%s: Debug stats received", __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
#endif
		break;
	case NRF_WIFI_EVENT_INT_UMAC_STATS:
#ifdef NRF71_UTIL
		status = umac_event_sys_umac_int_stats_process(fmac_dev_ctx,
							       sys_head);
#else
		LOG_DBG("%s: UMAC int stats received", __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
#endif
		break;
	case NRF_WIFI_EVENT_ERROR_STATS: {
#if WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF
		struct nrf_wifi_umac_event_error_stats *err_ev =
			(struct nrf_wifi_umac_event_error_stats *)sys_head;

		switch (err_ev->stats_type) {
		case RPU_STATS_TYPE_UMAC:
			log_error_stats(__func__, "UMAC", err_ev->status_code,
					umac_error_stats_log,
					sizeof(umac_error_stats_log) /
					sizeof(umac_error_stats_log[0]));
			break;
		case RPU_STATS_TYPE_LMAC:
			log_error_stats(__func__, "LMAC", err_ev->status_code,
					lmac_error_stats_log,
					sizeof(lmac_error_stats_log) /
					sizeof(lmac_error_stats_log[0]));
			break;
		default:
			LOG_INF("%s: Error stats event: "
					       "stats_type=%d status_code=%u",
					       __func__,
					       err_ev->stats_type,
					       err_ev->status_code);
			break;
		}
#endif /* WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF */
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	}
	case NRF_WIFI_EVENT_COEX_CONFIG: {
		struct nrf_wifi_event_coex_config *coex_event =
			(struct nrf_wifi_event_coex_config *)sys_head;
		struct nrf_wifi_sys_fmac_priv *sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);

		if (sys_fpriv->callbk_fns.coex_event_callbk_fn) {
			sys_fpriv->callbk_fns.coex_event_callbk_fn(
				fmac_dev_ctx->os_dev_ctx, coex_event->coex_config_info.coex_event,
				coex_event->coex_config_info.len);
		}
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	}
	default:
		LOG_ERR("%s: Unknown event recd: %d",
				      __func__,
				      ((struct nrf_wifi_sys_head *)sys_head)->cmd_event);
		break;
	}
	return status;
}


static enum nrf_wifi_status
nrf_wifi_fmac_data_event_process(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
				 void *umac_head)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_SUCCESS;
	int event = -1;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	if (!fmac_dev_ctx) {
		goto out;
	}

	if (!umac_head) {
		LOG_ERR("%s: Invalid parameters",
				      __func__);
		goto out;
	}

	event = ((struct nrf_wifi_umac_head *)umac_head)->cmd;

#ifdef NRF_WIFI_CMD_EVENT_LOG
	LOG_INF("%s: Event %d received from UMAC",
			      __func__,
			      event);
#else
	LOG_DBG("%s: Event %d received from UMAC",
			      __func__,
			      event);
#endif /* NRF_WIFI_CMD_EVENT_LOG */

	switch (event) {
	case NRF_WIFI_CMD_RX_BUFF:
#ifdef NRF71_RX_DONE_WQ_ENABLED
		struct nrf_wifi_rx_buff *config =
			nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
					    sizeof(struct nrf_wifi_rx_buff));
		if (!config) {
			LOG_ERR("%s: Failed to allocate memory (RX)",
					      __func__);
			status = NRF_WIFI_STATUS_FAIL;
			break;
		}
		nrf_wifi_mem_cpy(config,
				      umac_head,
				      sizeof(struct nrf_wifi_rx_buff));
		status = nrf_wifi_llist_add_tail_data(sys_dev_ctx->rx_config.rx_tasklet_event_q,
						  config);
		if (status != NRF_WIFI_STATUS_SUCCESS) {
			LOG_ERR("%s: Failed to enqueue RX buffer",
					      __func__);
			nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, config);
			break;
		}
		nrf_wifi_work_schedule(sys_dev_ctx->rx_tasklet);
#else
		status = nrf_wifi_fmac_rx_event_process(fmac_dev_ctx,
							umac_head);
#endif /* NRF71_RX_DONE_WQ_ENABLED */
		break;
#ifdef NRF71_DATA_TX
	case NRF_WIFI_CMD_TX_BUFF_DONE:
#ifdef NRF71_TX_DONE_WQ_ENABLED
		struct nrf_wifi_tx_buff_done *config =
			nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
					    sizeof(struct nrf_wifi_tx_buff_done));
		if (!config) {
			LOG_ERR("%s: Failed to allocate memory (TX)",
					      __func__);
			status = NRF_WIFI_STATUS_FAIL;
			break;
		}
		nrf_wifi_mem_cpy(config,
				      umac_head,
				      sizeof(struct nrf_wifi_tx_buff_done));
		status = nrf_wifi_llist_add_tail_data(
			sys_dev_ctx->tx_config.tx_done_tasklet_event_q, config);
		if (status != NRF_WIFI_STATUS_SUCCESS) {
			LOG_ERR("%s: Failed to enqueue TX buffer",
					      __func__);
			nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, config);
			break;
		}
		nrf_wifi_work_schedule(sys_dev_ctx->tx_done_tasklet);
#else
		status = nrf_wifi_fmac_tx_done_event_process(fmac_dev_ctx,
								umac_head);
#endif /* NRF71_TX_DONE_WQ_ENABLED */
		break;
	case NRF_WIFI_CMD_CARRIER_ON:
		status = nrf_wifi_fmac_if_carr_state_event_proc(fmac_dev_ctx,
								umac_head,
								NRF_WIFI_FMAC_IF_CARR_STATE_ON);
		break;
	case NRF_WIFI_CMD_CARRIER_OFF:
		status = nrf_wifi_fmac_if_carr_state_event_proc(fmac_dev_ctx,
								umac_head,
								NRF_WIFI_FMAC_IF_CARR_STATE_OFF);
		break;
#endif /* NRF71_DATA_TX */
#ifdef NRF71_AP_MODE
	case NRF_WIFI_CMD_PM_MODE:
		status = sap_client_update_pmmode(fmac_dev_ctx,
						  umac_head);
		break;
	case NRF_WIFI_CMD_PS_GET_FRAMES:
		status = sap_client_ps_get_frames(fmac_dev_ctx,
						  umac_head);
		break;
#endif /* NRF71_AP_MODE */
	default:
		break;
	}

out:
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: Failed for event = %d",
				      __func__,
				      event);
	}

